// //зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// //1. перебрати його циклом while
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = 0;
// while (i < A.length) {
//     console.log(A[i])           //while
//     i++
// }

//2. перебрати його циклом for
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 0; i < A.length; i++) {
//     console.log(A[i])
// }

// //3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = 1;
// while (i < A.length) {
//     console.log(A[i])           //while
//     i=i+2
// }

// //4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 1; i < A.length; i=i+2) {
//     console.log(A[i])
// }
// //5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = 0;
// while (i < A.length) {
//     if(A[i]%2 == 0){
//         console.log(A[i])
//     }
//     i++
// }
// //6. перебрати циклом for та вивести  числа тільки парні  значення
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 0; i < A.length; i++) {
//         if(A[i]%2 == 0){
//         console.log(A[i])
//     }
// }
// //7. замінити кожне число кратне 3 на слово "okten"
// let A = [2,17,13,6,22,31,45,66,100,-18]
// for (let i = 0; i < A.length; i++) {
//     if(A[i]%3 === 0){
//         A[i] ="okten"
//     }
// }
// console.log(A)

// //8. вивести масив в зворотньому порядку.
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = A.length - 1; i >= 0; i--) {
//     console.log(A[i]);
// }

//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// //зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// //1. перебрати його циклом while
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = A.length-1;
// while (i >= 0) {
//     console.log(A[i])           //while
//     i--
// }

// //2. перебрати його циклом for
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = A.length - 1; i >= 0; i--) {
//     console.log(A[i]);
//
// }

// // //3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = A.length-1;
// while (i >= 0) {
//     if(i%2 !== 0){console.log(A[i])}
//     i--
// }

// // //4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = A.length - 1; i >= 0; i--) {
//     console.log(A[i]);
// }
//5. перебрати циклом while та вивести  числа тільки парні  значення

// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = A.length-1;
// while (i >= 0) {
//     if(A[i]%2 === 0){console.log(A[i])}
//     i--
// }
// //6. перебрати циклом for та вивести  числа тільки парні  значення
// let A = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 0; i < A.length; i=i+2) {
//     console.log(A[i])
// }
// //7. замінити кожне число кратне 3 на слово "okten"
// let A = [2,17,13,6,22,31,45,66,100,-18]
// for (let i = A.length - 1; i >= 0; i--) {
//     if(A[i]%3 === 0){
//         A[i] ="okten"
//     }
// }
// console.log(A)


